app/controllers/evaluation_controller.rb

  def index
  @courses = Course.all
  @templetes = Templete.all
  @employees = Employee.all
  @users = User.all
  @answers = Answer.all
---
SELECT "courses".* FROM "courses" ORDER BY course
SELECT "templetes".* FROM "templetes"
SELECT "employees".* FROM "employees"
SELECT "users".* FROM "users"
SELECT "answers".* FROM "answers"