app/controllers/static_pages_controller.rb

SELECT "templetes".* FROM "templetes"
SELECT "employees".* FROM "employees"
SELECT "courses".* FROM "courses" ORDER BY course
SELECT "users".* FROM "users"
---
  def course
    @templetes = Templete.all
    @employees = Employee.all
    @courses = Course.all
    @users = User.all