app/controllers/templetes_controller.rb

SELECT "templetes".* FROM "templetes"
---
  def index
    @templetes = Templete.all

SELECT "templetes".* FROM "templetes" WHERE "templetes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @templete = Templete.find(params[:id])

SELECT "templetes".* FROM "templetes" WHERE "templetes"."id" = ? LIMIT 1  [["id", "4"]]
---
  def edit
    @templete = Templete.find(params[:id])

INSERT INTO "templetes" ("Evaluating_field", "Query_No_1", "Query_No_10", "Query_No_2", "Query_No_3", "Query_No_4", "Query_No_5", "Query_No_6", "Query_No_7", "Query_No_8", "Query_No_9", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @templete = Templete.new(params[:templete])

    respond_to do |format|
      if @templete.save

SELECT "templetes".* FROM "templetes" WHERE "templetes"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "templetes" SET "Evaluating_field" = 'Course', "Query_No_1" = 'Name of the course', "Query_No_2" = 'Reason to take this course', "Query_No_3" = 'Expected grade in this course', "Query_No_4" = 'current level in school', "Query_No_5" = 'Your major area', "Query_No_6" = 'Current GPA', "Query_No_7" = 'Satisfied with knowledge of the Instructor', "Query_No_8" = 'Instructor was well prepared for the course', "updated_at" = '2012-11-26 04:00:40.363274' WHERE "templetes"."id" = 4
---
  def update
    @templete = Templete.find(params[:id])

    respond_to do |format|
      if @templete.update_attributes(params[:templete])

SELECT "templetes".* FROM "templetes" WHERE "templetes"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "templetes" WHERE "templetes"."id" = ?  [["id", 2]]
---
  def destroy
    @templete = Templete.find(params[:id])
    @templete.destroy